In [1]:
import numpy as np
import pandas as pd

### This notebook contains:
1. Groupby
2. Merging / Joining
3. Concatenation

#### Groupby():

Any groupby operation involves one of the following operations on the original object. They are −

- Splitting the Object
- Applying a function
- Combining the results

In many situations, we split the data into sets and we apply some functionality on each subset. In the apply functionality, we can perform the following operations −

- Aggregation − computing a summary statistic
- Transformation − perform some group-specific operation
- Filtration − discarding the data with some condition

In [2]:
ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings', 'Sunrisers', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
   'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
   'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
   'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data)
df

         Team  Rank  Year  Points
0      Riders     1  2014     876
1      Riders     2  2015     789
2      Devils     2  2014     863
3      Devils     3  2015     673
4       Kings     3  2014     741
5   Sunrisers     4  2015     812
6       Kings     1  2016     756
7       Kings     1  2017     788
8      Riders     2  2016     694
9      Royals     4  2014     701
10     Royals     1  2015     804
11     Riders     2  2017     690

#### Split Data into Groups

Pandas object can be split into any of their objects. There are multiple ways to split an object like −

- obj.groupby('key')
- obj.groupby(['key1','key2'])
- obj.groupby(key,axis=1)

In [28]:
df.groupby('Team')

In [37]:
df.groupby(['Team','Rank'])

#### View Groups

In [32]:
df.groupby('Team').groups

{'Devils': Int64Index([2, 3], dtype='int64'),
 'Kings': Int64Index([4, 6, 7], dtype='int64'),
 'Riders': Int64Index([0, 1, 8, 11], dtype='int64'),
 'Royals': Int64Index([9, 10], dtype='int64'),
 'Sunrisers': Int64Index([5], dtype='int64')}

In [36]:
df.groupby(['Team','Rank']).groups

{('Devils', 2): Int64Index([2], dtype='int64'),
 ('Devils', 3): Int64Index([3], dtype='int64'),
 ('Kings', 1): Int64Index([6, 7], dtype='int64'),
 ('Kings', 3): Int64Index([4], dtype='int64'),
 ('Riders', 1): Int64Index([0], dtype='int64'),
 ('Riders', 2): Int64Index([1, 8, 11], dtype='int64'),
 ('Royals', 1): Int64Index([10], dtype='int64'),
 ('Royals', 4): Int64Index([9], dtype='int64'),
 ('Sunrisers', 4): Int64Index([5], dtype='int64')}

#### Iterating through Groups

- With the groupby object in hand, we can iterate through the object similar to itertools.obj.

In [50]:
grouped = df.groupby(['Year'])

for name, group in grouped:
    print(name)
    print(group)

2014
     Team  Rank  Year  Points
0  Riders     1  2014     876
2  Devils     2  2014     863
4   Kings     3  2014     741
9  Royals     4  2014     701
2015
         Team  Rank  Year  Points
1      Riders     2  2015     789
3      Devils     3  2015     673
5   Sunrisers     4  2015     812
10     Royals     1  2015     804
2016
     Team  Rank  Year  Points
6   Kings     1  2016     756
8  Riders     2  2016     694
2017
      Team  Rank  Year  Points
7    Kings     1  2017     788
11  Riders     2  2017     690

In [57]:
# Using the get_group() method, we can select a single group.

grouped = df.groupby('Year')
print(grouped.get_group(2014))

     Team  Rank  Year  Points
0  Riders     1  2014     876
2  Devils     2  2014     863
4   Kings     3  2014     741
9  Royals     4  2014     701

In [64]:
f = df.groupby('Team')
f.get_group('Riders')

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
8   Riders     2  2016     694
11  Riders     2  2017     690

#### Aggregations:
- An aggregated function returns a single aggregated value for each group. 
- Once the group by object is created, several aggregation operations can be performed on the grouped data.
- An obvious one is aggregation via the 'aggregate' or 'agg' method −

In [83]:
grouped = df.groupby('Year')
print(grouped['Points'].agg(np.mean))

Year
2014    795.25
2015    769.50
2016    725.00
2017    739.00
Name: Points, dtype: float64

In [84]:
df.groupby('Year')['Points'].aggregate('mean')     # alternative method of the above method

Year
2014    795.25
2015    769.50
2016    725.00
2017    739.00
Name: Points, dtype: float64

In [92]:
#  to see the size of each group is by applying the size() function −

df.groupby('Team').agg(np.size)

           Rank  Year  Points
Team
Devils        2     2       2
Kings         3     3       3
Riders        4     4       4
Royals        2     2       2
Sunrisers     1     1       1

#### Applying Multiple Aggregation Functions at Once:
- With grouped Series, you can also pass a list or dict of functions to do aggregation with, and generate DataFrame as output −

In [95]:
df.groupby('Team')['Points'].agg([np.mean, sum, np.min])

                 mean   sum  amin
Team
Devils     768.000000  1536   673
Kings      761.666667  2285   741
Riders     762.250000  3049   690
Royals     752.500000  1505   701
Sunrisers  812.000000   812   812

In [123]:
df.groupby(['Team','Year']).agg([np.mean,sum])

               Rank     Points
               mean sum   mean  sum
Team      Year
Devils    2014    2   2    863  863
          2015    3   3    673  673
Kings     2014    3   3    741  741
          2016    1   1    756  756
          2017    1   1    788  788
Riders    2014    1   1    876  876
          2015    2   2    789  789
          2016    2   2    694  694
          2017    2   2    690  690
Royals    2014    4   4    701  701
          2015    1   1    804  804
Sunrisers 2015    4   4    812  812

In [124]:
df1 = pd.DataFrame({'A': [1, 1, 2, 2], 'B': [1, 2, 3, 4], 'C': np.random.randn(4)})
df1

   A  B         C
0  1  1  1.075375
1  1  2  1.975985
2  2  3  0.721513
3  2  4 -0.558357

In [125]:
# Multiple aggregations
df1.groupby('A').agg(['min', 'max'])

    B             C
  min max       min       max
A
1   1   2  1.075375  1.975985
2   3   4 -0.558357  0.721513

In [130]:
# Select a column for aggregation

df1.groupby('A').B.agg(['min', 'max'])

   min  max
A
1    1    2
2    3    4

In [131]:
# Different aggregations per column

df1.groupby('A').agg({'B': ['min', 'max'], 'C': 'sum'})

    B             C
  min max       sum
A
1   1   2  3.051360
2   3   4  0.163156

In [133]:
# To control the output names with different aggregations per column, pandas supports "named aggregation"

df1.groupby("A").agg(b_min = pd.NamedAgg(column="B", aggfunc="min"), 
                     c_sum=pd.NamedAgg(column="C", aggfunc="sum"))

   b_min     c_sum
A
1      1  3.051360
2      3  0.163156

#### Transformations:

- Transformation on a group or a column returns an object that is indexed the same size of that is being grouped. 
- Thus, the transform should return a result that is the same size as that of a group chunk.

In [134]:
df

         Team  Rank  Year  Points
0      Riders     1  2014     876
1      Riders     2  2015     789
2      Devils     2  2014     863
3      Devils     3  2015     673
4       Kings     3  2014     741
5   Sunrisers     4  2015     812
6       Kings     1  2016     756
7       Kings     1  2017     788
8      Riders     2  2016     694
9      Royals     4  2014     701
10     Royals     1  2015     804
11     Riders     2  2017     690

In [110]:
grouped = df.groupby('Team')
score = lambda x: (x - x.mean()) / x.std()*10

In [111]:
print(grouped.transform(score))

         Rank       Year     Points
0  -15.000000 -11.618950  12.843272
1    5.000000  -3.872983   3.020286
2   -7.071068  -7.071068   7.071068
3    7.071068   7.071068  -7.071068
4   11.547005 -10.910895  -8.608621
5         NaN        NaN        NaN
6   -5.773503   2.182179  -2.360428
7   -5.773503   8.728716  10.969049
8    5.000000   3.872983  -7.705963
9    7.071068  -7.071068  -7.071068
10  -7.071068   7.071068   7.071068
11   5.000000  11.618950  -8.157595

In [114]:
grouped.transform(lambda x: x.max() - x.min())

    Rank  Year  Points
0      1     3     186
1      1     3     186
2      1     1     190
3      1     1     190
4      2     3      47
5      0     0       0
6      2     3      47
7      2     3      47
8      1     3     186
9      3     1     103
10     3     1     103
11     1     3     186

#### Filtration
- Filtration filters the data on a defined criteria and returns the subset of data.
- The filter() function is used to filter the data.

In [116]:
print(df.groupby('Team').filter(lambda x: len(x) >= 3))

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
4    Kings     3  2014     741
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
11  Riders     2  2017     690

- 'Riders' and 'Kings' are displayed because it occurs more than 3 times in the dataframe
- In the above filter condition, we are asking to return the teams which have participated three or more times in IPL.

#### Merging / Joining:

- Pandas has full-featured, high performance in-memory join operations idiomatically very similar to relational databases like SQL.
- Pandas provides a single function, merge, as the entry point for all standard database join operations between DataFrame objects −

***pd.merge(left, right, how='inner', on=None, left_on=None, right_on=None, left_index=False, right_index=False, sort=True)***

In [149]:
left = pd.DataFrame({'id':[1,2,3,4,5,6], 'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung', 'Ashish'],
   'subject_id':['sub1','sub2','sub4','sub6','sub5','sub6']})

right = pd.DataFrame({'id':[1,2,3,4,5], 'Name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
   'subject_id':['sub2','sub4','sub3','sub6','sub2']})

print(left,'\n')
print(right)

   id    Name subject_id
0   1    Alex       sub1
1   2     Amy       sub2
2   3   Allen       sub4
3   4   Alice       sub6
4   5  Ayoung       sub5
5   6  Ashish       sub6

   id   Name subject_id
0   1  Billy       sub2
1   2  Brian       sub4
2   3   Bran       sub3
3   4  Bryce       sub6
4   5  Betty       sub2

#### Inner Join 
- Join operation honors the object on which it is called. So, a.join(b) is not equal to b.join(a).

In [156]:
pd.merge(left = left, right = right, on = 'subject_id', how = 'inner')

   id_x  Name_x subject_id  id_y Name_y
0     2     Amy       sub2     1  Billy
1     2     Amy       sub2     5  Betty
2     3   Allen       sub4     2  Brian
3     4   Alice       sub6     4  Bryce
4     6  Ashish       sub6     4  Bryce

In [154]:
pd.merge(left = left, right = right, on = 'subject_id', how = 'left')

   id_x  Name_x subject_id  id_y Name_y
0     1    Alex       sub1   NaN    NaN
1     2     Amy       sub2   1.0  Billy
2     2     Amy       sub2   5.0  Betty
3     3   Allen       sub4   2.0  Brian
4     4   Alice       sub6   4.0  Bryce
5     5  Ayoung       sub5   NaN    NaN
6     6  Ashish       sub6   4.0  Bryce

In [155]:
pd.merge(left = left, right = right, on = 'subject_id', how = 'right')

   id_x  Name_x subject_id  id_y Name_y
0   2.0     Amy       sub2     1  Billy
1   2.0     Amy       sub2     5  Betty
2   3.0   Allen       sub4     2  Brian
3   4.0   Alice       sub6     4  Bryce
4   6.0  Ashish       sub6     4  Bryce
5   NaN     NaN       sub3     3   Bran

In [165]:
# merge two dataframes on multiple keys

print(pd.merge(left, right, on = ['id','subject_id']))

   id Name_x subject_id Name_y
0   4  Alice       sub6  Bryce

In [166]:
pd.merge(left, right, on = 'subject_id', how = 'outer')

   id_x  Name_x subject_id  id_y Name_y
0   1.0    Alex       sub1   NaN    NaN
1   2.0     Amy       sub2   1.0  Billy
2   2.0     Amy       sub2   5.0  Betty
3   3.0   Allen       sub4   2.0  Brian
4   4.0   Alice       sub6   4.0  Bryce
5   6.0  Ashish       sub6   4.0  Bryce
6   5.0  Ayoung       sub5   NaN    NaN
7   NaN     NaN       sub3   3.0   Bran

#### Concatenation:

***pd.concat(objs, axis=0, join='outer', join_axes=None, ignore_index=False)***

In [172]:
# Combine two Series

s1 = pd.Series(['a', 'b'])
s2 = pd.Series(['c', 'd'])
print(s1)
print(s2)

0    a
1    b
dtype: object
0    c
1    d
dtype: object

In [171]:
pd.concat([s1, s2])

0    a
1    b
0    c
1    d
dtype: object

In [173]:
# Clear the existing index and reset it in the result by setting the 'ignore_index = True'.

pd.concat([s1, s2], ignore_index=True)

0    a
1    b
2    c
3    d
dtype: object

In [174]:
# Add a hierarchical index at the outermost level of the data with the ``keys`` option.

pd.concat([s1, s2], keys=['s1', 's2'])

s1  0    a
    1    b
s2  0    c
    1    d
dtype: object

In [175]:
# Label the index keys you create with the ``names`` option.

pd.concat([s1, s2], keys=['s1', 's2'], names = ['Series name', 'Row ID'])

Series name  Row ID
s1           0         a
             1         b
s2           0         c
             1         d
dtype: object

In [176]:
one = pd.DataFrame({
   'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
   'subject_id':['sub1','sub2','sub4','sub6','sub5'],
   'Marks_scored':[98,90,87,69,78]},
   index=[1,2,3,4,5])

two = pd.DataFrame({
   'Name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
   'subject_id':['sub2','sub4','sub3','sub6','sub5'],
   'Marks_scored':[89,80,79,97,88]},
   index=[1,2,3,4,5])

In [177]:
print(one)
print('\n',two)

     Name subject_id  Marks_scored
1    Alex       sub1            98
2     Amy       sub2            90
3   Allen       sub4            87
4   Alice       sub6            69
5  Ayoung       sub5            78

     Name subject_id  Marks_scored
1  Billy       sub2            89
2  Brian       sub4            80
3   Bran       sub3            79
4  Bryce       sub6            97
5  Betty       sub5            88

In [179]:
pd.concat([one,two])

     Name subject_id  Marks_scored
1    Alex       sub1            98
2     Amy       sub2            90
3   Allen       sub4            87
4   Alice       sub6            69
5  Ayoung       sub5            78
1   Billy       sub2            89
2   Brian       sub4            80
3    Bran       sub3            79
4   Bryce       sub6            97
5   Betty       sub5            88

- Suppose we wanted to associate specific keys with each of the pieces of the chopped up DataFrame. We can do this by using the keys argument −

In [180]:
pd.concat([one,two], keys = ['x', 'y'])

       Name subject_id  Marks_scored
x 1    Alex       sub1            98
  2     Amy       sub2            90
  3   Allen       sub4            87
  4   Alice       sub6            69
  5  Ayoung       sub5            78
y 1   Billy       sub2            89
  2   Brian       sub4            80
  3    Bran       sub3            79
  4   Bryce       sub6            97
  5   Betty       sub5            88

In [182]:
### If two objects need to be added along axis=1, then the new columns will be appended.

print(pd.concat([one,two],axis=1))

     Name subject_id  Marks_scored   Name subject_id  Marks_scored
1    Alex       sub1            98  Billy       sub2            89
2     Amy       sub2            90  Brian       sub4            80
3   Allen       sub4            87   Bran       sub3            79
4   Alice       sub6            69  Bryce       sub6            97
5  Ayoung       sub5            78  Betty       sub5            88

#### Concatenating Using append():
- A useful shortcut to concat are the 'append' instance methods on Series and DataFrame. 
- These methods actually predated concat. They concatenate along axis=0, namely the index −

In [183]:
one.append(two)

     Name subject_id  Marks_scored
1    Alex       sub1            98
2     Amy       sub2            90
3   Allen       sub4            87
4   Alice       sub6            69
5  Ayoung       sub5            78
1   Billy       sub2            89
2   Brian       sub4            80
3    Bran       sub3            79
4   Bryce       sub6            97
5   Betty       sub5            88

In [184]:
# append takes multiple objects as well
one.append([two,one])

     Name subject_id  Marks_scored
1    Alex       sub1            98
2     Amy       sub2            90
3   Allen       sub4            87
4   Alice       sub6            69
5  Ayoung       sub5            78
1   Billy       sub2            89
2   Brian       sub4            80
3    Bran       sub3            79
4   Bryce       sub6            97
5   Betty       sub5            88
1    Alex       sub1            98
2     Amy       sub2            90
3   Allen       sub4            87
4   Alice       sub6            69
5  Ayoung       sub5            78